import test from 'ava';
import NHolidayJp from '../lib/index';

const holidays = {
  '2019': [
    [1, 1, '元日'],
    [1, 14, '成人の日'],
    [2, 11, '建国記念の日'],
    [3, 21, '春分の日'],
    [4, 29, '昭和の日'],
    [4, 30, '国民の休日'],
    [5, 1, '即位の日'],
    [5, 2, '国民の休日'],
    [5, 3, '憲法記念日'],
    [5, 4, 'みどりの日'],
    [5, 5, 'こどもの日'],
    [5, 6, '振替休日'],
    [7, 15, '海の日'],
    [8, 11, '山の日'],
    [8, 12, '振替休日'],
    [9, 16, '敬老の日'],
    [9, 23, '秋分の日'],
    [10, 14, '体育の日'],
    [10, 22, '即位の礼正殿の儀'],
    [11, 3, '文化の日'],
    [11, 4, '振替休日'],
    [11, 23, '勤労感謝の日'],
  ],
};

function getArrayList(year) {
  return NHolidayJp.getByYear(year).map(v => [v.month, v.date, v.name]);
}

test('2019', t => t.deepEqual(getArrayList(2019), holidays['2019']));
